In [1]:
# Import Libraries aka Dependencies 
import pandas as pd
import numpy as np

In [2]:
# Create a reference to the CSV file desired
students = "students_complete.csv"

# Read the CSV into Pandas DataFrame
students_df = pd.read_csv(students)

# Pring the first 5 rows of the data to the screen
students_df.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [3]:
# Create a reference to the CSV; Mapping let's you format an entire DataFrame
schools = "schools_complete.csv"

#Read the CSV into Pandas DataFrame
schools_df = pd.read_csv(schools)

#Pring the first 5 rows of the data to the screen
schools_df.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
# Find a common column of the 2 CSV's and filter using groupby
# First, need to rename 'name' in Schools_complete.csv to 'school'
# Rename columns so that they are differentiated
schools_df = schools_df.rename(columns={"name":"School Name"})

# Print the first 5 rows of data to the screen
schools_df.head()

   School ID            School Name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [27]:
# Merging Tables - students info
# students_pd = pd.DataFrame(students_df, columns=["school", "Student ID", "name", "gender",
#                                                      "grade", "reading_score", 
#                                                      "math_score"])
students_pd = students_pd.rename(columns={"school":"School Name"})

In [28]:
# Merging Tables - schools info
schools_pd = pd.DataFrame(schools_df, columns=["School Name","School ID", "type", "size",
                                                   "budget"])
schools_pd.head()

             School Name  School ID      type  size   budget
0      Huang High School          0  District  2917  1910635
1   Figueroa High School          1  District  2949  1884411
2    Shelton High School          2   Charter  1761  1056600
3  Hernandez High School          3  District  4635  3022020
4    Griffin High School          4   Charter  1468   917500

In [31]:
# Merge two dataframes using an outer join
Students_and_Schools = pd.merge(students_pd, schools_pd, on="School Name", how="outer")
Students_and_Schools.head()

,School Name,Student ID,name,gender,grade,reading_score,math_score,School ID,type,size,budget
0,Huang High School,0,Paul Bradley,M,9th,66,79,0,District,2917,1910635
1,Huang High School,1,Victor Smith,M,12th,94,61,0,District,2917,1910635
2,Huang High School,2,Kevin Rodriguez,M,12th,90,60,0,District,2917,1910635
3,Huang High School,3,Dr. Richard Scott,M,12th,67,58,0,District,2917,1910635
4,Huang High School,4,Bonnie Ray,F,9th,97,84,0,District,2917,1910635

In [32]:
# Find Total Schools
Total_Schools = round(len(schools_df),0)
Total_Schools

15

In [33]:
# Find Total Students
Total_Students = len(students_df)
Total_Students

39170

In [34]:
# Find Total Budget
Budget_Total = schools_df["budget"].sum()
Budget_Total
# Total Budget is 24649428

24649428

In [35]:
# Find Average Math Score
Avg_Math_Score = students_df["math_score"].mean()
Avg_Math_Score
# Average Math Score is 78.99

78.98537145774827

In [36]:
# Find Average Reading Score
Avg_Read_Score = students_df["reading_score"].mean()
Avg_Read_Score
# Average Reading Score is 81.88

81.87784018381414

In [37]:
# counting how many students passed math, where the score of >70 is passing

passing_math = students_df[students_df.math_score>70]
passing_math_result = len(passing_math)
passing_math_result

28356

In [38]:
# percent passing math

Percent_Passing_Math = (passing_math_result) / Total_Students * 100
Percent_Passing_Math

72.39213683941792

In [39]:
# counting how many students passed reading, where the score of >70 is passing

passing_reading = students_df[students_df.reading_score>70]
passing_reading_result = len(passing_reading)
print (passing_reading_result)

32500

In [40]:
# percent passing reading

Percent_Passing_Reading = (passing_reading_result) / Total_Students * 100
Percent_Passing_Reading

82.97166198621395

In [41]:
# Overall Passing Rate (Average of the above two)
Overall_Passing_Rate = ((Percent_Passing_Math) + (Percent_Passing_Reading))/2
Overall_Passing_Rate

77.68189941281594

# District Summary

In [42]:
District_Summary_Table_df1 = pd.DataFrame({"Summary Labels":["Total Schools","Total Students",
                                                            "Total Budget","Average Math Score",
                                                            "Average Reading Score","% Passing Math",
                                                            "% Passing Reading","Overall Passing Rate"],
                                          "Summary Data":[Total_Schools,Total_Students,Budget_Total,
                                                         Avg_Math_Score,Avg_Read_Score,Percent_Passing_Math,
                                                         Percent_Passing_Reading,Overall_Passing_Rate]})



District_Summary_Table_df1.set_index("Summary Labels")

                       Summary Data
Summary Labels
Total Schools          1.500000e+01
Total Students         3.917000e+04
Total Budget           2.464943e+07
Average Math Score     7.898537e+01
Average Reading Score  8.187784e+01
% Passing Math         7.239214e+01
% Passing Reading      8.297166e+01
Overall Passing Rate   7.768190e+01

# School Summary

In [50]:
#Students_and_Schools[Students_and_Schools.math_score>70]
#100*Students_and_Schools[Students_and_Schools.math_score>70].groupby("school").count()["size"]/Students_and_Schools.groupby("school").count()['size']

#.groupby("school").mean()[['reading_score','math_score']]

In [51]:
Avg_School_Scores = Students_and_Schools.groupby("School Name").mean()[["math_score","reading_score"]]
Avg_School_Scores.head(2)

                     math_score  reading_score
School Name
Bailey High School    77.048432      81.033963
Cabrera High School   83.061895      83.975780

In [54]:
# Percent_Passing_Math
Percent_Passing_Math = 100*Students_and_Schools[Students_and_Schools.math_score>70].groupby("School Name").count()["size"]/Students_and_Schools.groupby("School Name").count()['size']

In [55]:
# Percent_Passing_Reading
Percent_Passing_Reading = 100*Students_and_Schools[Students_and_Schools.reading_score>70].groupby("School Name").count()["size"]/Students_and_Schools.groupby("School Name").count()['size']

In [58]:
# School Name
Per_School_Name = schools_df["School Name"]

# School Type
Per_School_Type = schools_df["type"]

# Total Students per school
Per_School_Students = schools_df["size"]

# Total School Budget 
Per_Budget_Total = schools_df["budget"]

# Per Student Budget
Per_Student_Budget = schools_df["budget"]/schools_df["size"]

#schools_df["budget"]/schools_df["size"]

# Average Math Score per school
#.groupby students_df by "school" and find mean of math scores
Avg_School_Math = Avg_School_Scores["math_score"]

# Average Reading Score per School
Avg_School_Reading = Avg_School_Scores["reading_score"]

# % Passing Math
Percent_Passing_Math = Percent_Passing_Math

# % Passing Reading
Percent_Passing_Reading = Percent_Passing_Reading

# Overall Passing Rate
Overall_Passing_Rate = ((Percent_Passing_Math) + (Percent_Passing_Reading))/2

In [66]:
school_summary2_df = pd.DataFrame({"School Name": Per_School_Name, 
                                  "School Type": Per_School_Type, 
                                  "Total Students": Per_School_Students,
                                  "Total School Budget":Per_Budget_Total, 
                                  "Per Student Budget":Per_Student_Budget
                                  })
school_summary2_df.head(100)

,Per Student Budget,School Name,School Type,Total School Budget,Total Students
0,655.0,Huang High School,District,1910635,2917
1,639.0,Figueroa High School,District,1884411,2949
2,600.0,Shelton High School,Charter,1056600,1761
3,652.0,Hernandez High School,District,3022020,4635
4,625.0,Griffin High School,Charter,917500,1468
5,578.0,Wilson High School,Charter,1319574,2283
6,582.0,Cabrera High School,Charter,1081356,1858
7,628.0,Bailey High School,District,3124928,4976
8,581.0,Holden High School,Charter,248087,427
9,609.0,Pena High School,Charter,585858,962
10,583.0,Wright High School,Charter,1049400,1800
11,637.0,Rodriguez High School,District,2547363,3999
12,650.0,Johnson High School,District,3094650,4761
13,644.0,Ford High School,District,1763916,2739
14,638.0,Thomas High School,Charter,1043130,1635

In [60]:
# School Summary

school_summary_pd = pd.DataFrame({"Average Math Score":Avg_School_Math, 
                                  "Average Reading Score":Avg_School_Reading,
                                  "% Passing Math":Percent_Passing_Math, 
                                  "% Passing Reading":Percent_Passing_Reading, 
                                  "Overall Passing Rate":Overall_Passing_Rate
                                 })
school_summary_pd.head(100)

,% Passing Math,% Passing Reading,Average Math Score,Average Reading Score,Overall Passing Rate
School Name,,,,,
Bailey High School,64.630225,79.300643,77.048432,81.033963,71.965434
Cabrera High School,89.558665,93.864370,83.061895,83.975780,91.711518
Figueroa High School,63.750424,78.433367,76.711767,81.158020,71.091896
Ford High School,65.753925,77.510040,77.102592,80.746258,71.631982
Griffin High School,89.713896,93.392371,83.351499,83.816757,91.553134
Hernandez High School,64.746494,78.187702,77.289752,80.934412,71.467098
Holden High School,90.632319,92.740047,83.803279,83.814988,91.686183
Huang High School,63.318478,78.813850,76.629414,81.182722,71.066164
Johnson High School,63.852132,78.281874,77.072464,80.966394,71.067003
Pena High School,91.683992,92.203742,83.839917,84.044699,91.943867
Rodriguez High School,64.066017,77.744436,76.842711,80.744686,70.905226
Shelton High School,89.892107,92.617831,83.359455,83.725724,91.254969
Thomas High School,90.214067,92.905199,83.418349,83.848930,91.559633
Wilson High School,90.932983,93.254490,83.274201,83.989488,92.093736
Wright High School,90.277778,93.444444,83.682222,83.955000,91.861111

# Top Performing Schools by Passing Rate

In [72]:
Top_performing_schools = school_summary_pd.sort_values("Overall Passing Rate", ascending=False)
Top_performing_schools.head()

,% Passing Math,% Passing Reading,Average Math Score,Average Reading Score,Overall Passing Rate
School Name,,,,,
Wilson High School,90.932983,93.254490,83.274201,83.989488,92.093736
Pena High School,91.683992,92.203742,83.839917,84.044699,91.943867
Wright High School,90.277778,93.444444,83.682222,83.955000,91.861111
Cabrera High School,89.558665,93.864370,83.061895,83.975780,91.711518
Holden High School,90.632319,92.740047,83.803279,83.814988,91.686183

# Bottom Performing Schools by Passing Rate

In [73]:
Top_performing_schools = school_summary_pd.sort_values("Overall Passing Rate", ascending=True)
Top_performing_schools.head()

,% Passing Math,% Passing Reading,Average Math Score,Average Reading Score,Overall Passing Rate
School Name,,,,,
Rodriguez High School,64.066017,77.744436,76.842711,80.744686,70.905226
Huang High School,63.318478,78.813850,76.629414,81.182722,71.066164
Johnson High School,63.852132,78.281874,77.072464,80.966394,71.067003
Figueroa High School,63.750424,78.433367,76.711767,81.158020,71.091896
Hernandez High School,64.746494,78.187702,77.289752,80.934412,71.467098

# Math Scores by Grade

In [74]:
pd.DataFrame(students_df.groupby('grade').mean()['math_score']).reset_index()

  grade  math_score
0  10th   78.941483
1  11th   79.083548
2  12th   78.993164
3   9th   78.935659

# Reading Scores by Grade

In [75]:
pd.DataFrame(students_df.groupby('grade').mean()['reading_score']).reset_index()

  grade  reading_score
0  10th      81.874410
1  11th      81.885714
2  12th      81.819851
3   9th      81.914358

# Scores by School Spending

# Scores by School Size

# Scores by School Type

In [ ]:
# Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable 
#bins to group school spending. Include in the table each of the following:
# Average Math Score
# Average Reading Score
# % Passing Math
# % Passing Reading
# Overall Passing Rate (Average of the above two)

In [ ]:
# Create Bins in which the data will be held
# the bins are 0 to 585, 585 to 615, 615 to 645, 645 to 675
bins = [0, 585, 615, 645, 675]

# Create names for the four bins
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

In [ ]:
# Cut school budget and place the budget into bins
pd.cut(budget_series["budget"], bins, labels=group_names)